перем ПервыйЗапуск;			 

&НаСервере
Процедура АЛСАВ_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	// Вставить содержимое обработчика.                               
	
	флагОбновления = АЛСАВ_ОбновитьДопРеквизиты(ТекущийОбъект);	
	Если (флагОбновления) И ПервыйЗапуск тогда
		ЭтаФорма.Прочитать();		
	КонецЕсли;   
	
	ПервыйЗапуск = Ложь;
КонецПроцедуры

&НаСервере
Процедура АЛСАВ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура АЛСАВ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	АЛСАВ_ОбновитьДопРеквизиты(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Функция АЛСАВ_ОбновитьДопРеквизиты(ТекущийОбъект)
	//Вставить содержимое обработчика   
    УстановитьПривилегированныйРежим(Истина);
	ф1 = ложь;
	ф2 = ложь;
	ф3 = ложь;
	Попытка
		ф1 = Справочники.Сотрудники.ЗаполнитьДопРеквСотрудник(ТекущийОбъект.Ссылка); 
	Исключение
	КонецПопытки;
	
	Попытка
		ф2 = Справочники.Сотрудники.ЗаполнитьДопРеквФизЛицо(ТекущийОбъект.Ссылка.ФизическоеЛицо); 
	Исключение
	КонецПопытки;
	
	Попытка
		ф3 = Справочники.Сотрудники.ЗаполнитьДопРеквОрганизация(ТекущийОбъект.Ссылка.ГоловнаяОрганизация); 
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат (ф1 или ф2 или ф3)
КонецФункции

ПервыйЗапуск = истина;